命令功能：
  复制文件或者目录
命令格式：
  cp [option]... [-T] 源路径 目的路径（目的端可以使目录或者文件）
  cp [option]... 源路径... 目录路径  （源路径可以为多个，目的端为目录）
  cp [option]... -t 目录路径 源路径...（源路径可以为多个，目的端为目录）
常用命令参数：
  -a，--archive  与-dR  --preserve=all 功能相同   保留链接和文件属性，递归拷贝目录
  -d 拷贝时保留链接
  -f  删除已经存在目标文件，当与-n共用时不提示是否删除文件
  -i  覆盖目标文件前将给出确认提示，属于交互式拷贝
  -p  复制源文件内容后，还将把其修改时间和访问权限也复制到新文件中
  -r，-R 递归复制目录（即复制目录及其目录内的所有内容）
  -l  不作拷贝，只是硬链接文件
  -s  复制成符号链接文件
  -u  在源文件较新或者目标文件丢失时，更新目标文件

注：该命令参数过多，只列出一些比较常见的命令，若要查看全部参数，请使用 man cp 进行查阅，可以提高英语水平哟
