命令功能：
  列出目标目录中所有的子目录和文件
命令格式：
  ls [option] [文件名]
    常用option：
      -a, --all  列出目录下所有的文件，包括以 . 开头的隐含文件
      -A，--almost-all  列出目录下所有文件，除了以 . 和 .. 开头的文件
      --author  配合-l， 打印出每个文件的作者
      -c  根据最新的 ctime 排序
          配合-lt， 根据 ctime 排序及显示 ctime （文件状态最后更改的时间）
          配合-l，显示 ctime 并且根据名字排序
      -color[=WHEN] 是否给输出内容使用彩色分辨。 WHEN=never|always|auto
      -d，--directory  将目录像文件一样显示，但不显示目录内的文件
      -F，--classify 在每一个文件的末尾加上一个字符说明该文件的类型。"@"表示符号链接、"|"表示FIFOS、"/"表示目录、"="表示套接字
      -h,--human-readable 配合 -l 和/或者 -s，打印出可以阅读的文件大小（例如 1K 234M 2G）
      -l  每一行仅列出一个文件，并且列出该文件的相对应信息
      -s，--size 在每个文件名后输出该文件的大小  
      -S  以文件大小排序
      -r，--reverse  将目录反向排序
      -R，--recursive  列出所有子目录下的文件
      -t  以文件修改时间排序，从最新的开始
      -u  以上次访问的时间排序，从最新的开始
          配合-lt 根据访问时间排序并显示
          配合-l  根据文件名称排序并显示访问时间
      -x  按列输出，横向排序
      -X  以文件的扩展名排序
      --help  显示帮助信息并退出
      --version 输出版本信息并退出
     
如果还想了解更多参数，可以使用 man ls 进行查找，这也能提高对英文的学习！！
      
      
  
